
let man = {
    name: "sali",
    surname: "kotiev",
    age: 23, 
    login: "qwert",
    height: 1,86,
    weight: 78,
    password: 12345,
    many: 1000, 
}

/* Создать объект  man с информацией о человеке. Он должен содержать следующие свойства: имя, фамилия, возраст, рост(м), вес(кг), логин, 
пароль, сумма денег на счете; */

man.placeResidence = {
    city: "nazran",
    house: 3,
    street: "kotieva",

};

let a = 'sali'
if(a== men.password){
    console.log (`Добро пожаловать,${men.name}. Ваш логин ${men.login}`)
} else {
    console.log(`Указанный пароль ${a} не верен. Попробуйте еще раз`)
}



//После создания отдельно(вне объекта) добавить свойство с информацией об адресе. Само это свойство должны быть объектом, в котором должны быть 3 свойства:
// город, улица, дом.  