let a = [];
//после задачи A выведи в консоль первый элемент массива;
console.log (a[0]);

let two = [1,45, 5];
// (B)выведи в консоль сумму первого и третьего элеметов массива;
console.log (two[0] + two[5]);

let three = ["5", "6" "7"];
// (c) выведи в консоль строку, в которой склеены все три элемента массива;
console.log = [three[0] + three[1] + three[2]];


let six = [4, 9, 44, "adam", "movsar", "aslan"];
/* (D) выведи в консоль такую строку: 1-й элемент массива - [тут сам элемент], 
а последний элемент - [тут сам элемент] (при решении вспомни про обратные кавычки);
*/
console.log( Первый элемент массива ${six[0]} , '\n', `последний элемент  ${six[six.length -1]}`);


let maygroup = ["adam" , "movsar", "mansur", "aslan", "abdulla", "sali", "bashir", "amin", "muhammad", "hasan", "alvi", "yahya", "ramzan", "seda"];
// (E) выведи в консоль пятый элемент текущего массива и последний элемент массива из задания B;
console.log(maygroup[0],two[2]);


let f = [1, "zadacha", null, undefined, true, false];
// (F) выведи каждый элемент массива в отдельный console.log();


let empty = [ [], [], []];
// (G) выведи в консоль длину массива;
console.log (empty.length);


let double = [  [44, 77, 88], [22, 44, 76]  ];
/* H выведи в консоль произведение второго элемента первого вложенного массива
 и третьего элемента второго вложенного массива. /*